package ch02;

public class Stu07 {

	public static void main(String[] args) {
		/*
		 * [6-10] 다음 중 생성자에 대한 설명으로 옳지 않은 것은? (모두 고르시오.)	
		 * 
		 * a. 모든 생성자의 이름은 클래스의 이름과 동일해야 한다. (O)
		 * b. 생성자는 객체를 생성하기 위한 것이다. (X) - new연산자
		 * c. 클래스에는 생성자가 반드시 하나 이상 있어야 한다. (O)
		 * d. 생성자가 없는 클래스는 컴파일러가 기본 생성자를 추가한다. (O)
		 * e. 생성자는 오버로딩 할 수 없다.(X)	- 오버로딩 가능
		 * 
		 * 답 : b,e
		 */
		 
		 /*
		  * [6-11] 다음 중 this에 대한 설명으로 맞지 않은 것은 ? (모두 고르시오.) 틀림
		  * 
		  * a. 객체 자신을 가리키는 참조변수이다. (X)	- 멤버변수/멤버메소드
		  * b. 클래스 내에서라면 어디서든 사용할 수 있다. (O)	- 인스턴스 메서드에서만 사용 가능
		  * c. 지역변수와 인스턴스변수를 구별할 때 사용한다.	(X) - 멤버를 구별하기 위해 
		  * d. 클래스 메서드내에서는 사용할 수 없다. (O)
		  * 
		  * 답 : a,c		// b임...
		  * 
		  */
		 
		/*
		 * [6-12] 다음 중 오버로딩이 성립하기 위한 조건이 아닌 것은 ? (모두 고르시오.)
		 * 
		 * a. 메서드의 이름이 같아야 한다. (O)
		 * b. 매개변수의 개수나 타입이 달라야 한다. (O)
		 * c. 리턴 타입이 달라야 한다. (X)	- 리턴타입은 상관없음
		 * d. 매개변수의 이름이 달라야 한다. (X) - 매개변수 이름이 달라도 타입, 개수가 같으면 성립 안 됨
		 * 
		 * 답 : c,d
		 */
	}
	
	

}
